app/controllers/messages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "dieter"]]
---
  def index
    if $gUsername != ""
      @messages=[]
      timestamp = Time.now.to_i
      data = $gUsername.to_s+timestamp.to_s
      digest = OpenSSL::Digest::SHA256.new
      signature = $gPrivkey_user.sign digest, data

      response = HTTParty.get($URL+$gUsername+'/message',
        :body => {  :timestamp => timestamp,
                    :sig_user => Base64.strict_encode64(signature)
                  }.to_json,
      :headers => { 'Content-Type' => 'application/json' })

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "hans"]]
---
  def create
    if $gUsername != ""
    @message = Message.new(message_params)

    pubkeyResponse = HTTParty.get($URL+@message.username.downcase+'/pubkey',
    :headers => { 'Content-Type' => 'application/json' })